[
  {
    "text": "Does the company sell a software product or products?",
    "positiveAnswer": "YES",
    "detailedDescription": "Does the company sell a software product to other businesses? Software development services don't count. It has to be a product with a name and a price.",
    "searchGuidance": "Use perplexity search.",
    "disqualificationCriteria": "The company should be disqualified if it primarily offers custom software development, IT consulting, implementation services, or integration of third-party software without having its own products. Companies describing themselves as 'software development shops' or 'dev agencies' are typically not what we're looking for.\n\nIf results from a perplexity search mention nothing about software products, and only services, then you know it does not sell a software product and the answer is \"No\"."
  },
  {
    "text": "Are the company's products vertical market software?",
    "positiveAnswer": "YES",
    "detailedDescription": "Vertical market software is designed to address the needs of a specific industry or business type, rather than being general-purpose software. We're looking for software that specializes in a particular industry vertical like healthcare, legal, construction, manufacturing, etc.",
    "searchGuidance": "Look at how the company describes its target market. Check if they mention specific industries they serve. Examine customer testimonials and case studies for industry focus. Look for industry-specific terminology or features in their product descriptions.",
    "disqualificationCriteria": "The company should be disqualified if their products are horizontal (designed for all businesses regardless of industry) like general accounting software, generalized CRM, or productivity tools that aren't industry-specific."
  },
  {
    "text": "Who is the president or owner of the company?",
    "positiveAnswer": "NAME",
    "detailedDescription": "We need to identify the primary decision-maker at the company - typically the founder, CEO, president, or majority owner. For small businesses, this is often one person who holds a title like Owner, President, CEO, or Founder. If you can't find an answer, say FINAL ANSWER: unknown.",
    "searchGuidance": "Check the company website's 'About Us', 'Team', or 'Leadership' pages. LinkedIn company page often lists key executives. For smaller companies, also look at LinkedIn profiles connected to the company with founder/owner/CEO titles. State business registrations sometimes list owners/officers.",
    "disqualificationCriteria": "This question doesn't disqualify a company, but is used to gather information for subsequent questions. If no clear owner can be identified, say FINAL ANSWER: unknown."
  },
  {
    "text": "Is the owner of the company at least 50 years old?",
    "positiveAnswer": "YES",
    "detailedDescription": "We need to verify if the identified owner/president is at least 50 years of age. This helps identify established business owners rather than younger entrepreneurs.",
    "searchGuidance": "Use public records services or search for information about education/career timeline that might indicate approximate age. Look for graduation dates on LinkedIn that might suggest approximate age (e.g., college graduation in 1995 or earlier would suggest they're likely 50+). Search for news articles or interviews that might mention age or career length.",
    "disqualificationCriteria": "If you find concrete evidence that the owner is under 50 years old, the company should be disqualified."
  },
  {
    "text": "Does the company number between 5 and 40 employees?",
    "positiveAnswer": "YES",
    "detailedDescription": "We're looking for small businesses with enough employees to be established (at least 5) but not so large that they're beyond our target size (no more than 40).",
    "searchGuidance": "Check LinkedIn company page which often shows employee count. Look at the company website's team or about page to count visible employees. If exact counts aren't available, you might estimate based on company size descriptions (small, medium) and annual revenue.",
    "disqualificationCriteria": "Companies with fewer than 5 employees may be too small or too new. Companies with more than 40 employees are too large for our criteria."
  },
  {
    "text": "Is the company bootstrapped?",
    "positiveAnswer": "YES",
    "detailedDescription": "We're looking for companies that are self-funded (bootstrapped) rather than venture-backed or private equity owned. Bootstrapped companies are typically funded by the founders, their revenue, or small personal investments rather than institutional investors.",
    "searchGuidance": "Look for funding information on Crunchbase, which typically lists investment rounds. Check company press releases or news for mentions of funding. Review the company's 'About Us' page which might mention their funding approach. Absence of VC funding information often suggests bootstrapping.",
    "disqualificationCriteria": "Evidence of venture capital funding, private equity ownership, or being acquired by a larger company would disqualify the business. If there's no indication of external funding, assume the company is bootstrapped."
  },
  {
    "text": "Are the majority of the employees based in the USA?",
    "positiveAnswer": "YES",
    "detailedDescription": "We want to identify companies with most of their workforce in the United States rather than primarily offshore operations.",
    "searchGuidance": "Check the company website for office locations. Look at employee LinkedIn profiles to see where they're located. Check job postings to see where they're hiring.",
    "disqualificationCriteria": "If most employees appear to be located outside the USA, or if the company primarily advertises its offshore development capabilities, it should be disqualified."
  }
]